package main

import "fmt"

/*
	欢迎来到热身章节，从这里开始我们将带您一步步地熟悉 GitHub Classroom 的使用

	通常，每一个任务会有一个输入与输出，输入会由后台给出(给出的方式可以是直接通过
	输入流传入，也可以是执行提前在项目中设置好的脚本文件)

	您的程序需要根据传入的输入进行相应的输出，可直接传到标准输出，也可发送一个
	Web 请求，具体要求视不同任务要求来定

	任务通常不会对您的项目结构提出要求，但有些可能会检查您的项目结构是否合理以及
	您是否在指定区域进行作答，通常这种情况发生的概率很小(因为我懒得实现x)
*/

func main() {
	// 这里只需要实现一个判断输入的数是否小于 10 的简单程序即可，数据范围: 0~1<<31-1
	var num int
	fmt.Scanln("Please input a number(between 0 and 10, edge included): %d", &num)
	fmt.Println(0 <= num && num <= 10) // 打印的输出将由后台判断时候正确
}
